Revit 2027 API
BoundingBoxIntersectsFilter.Tolerance Property
 Allows control over the match criteria by using a tolerance in the geometry comparison. It is suggested to use this in cases where trivial differences should be considered when matching elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Tolerance { get; set; }
Public Property Tolerance As Double
	Get
	Set
public:
property double Tolerance {
	double get ();
	void set (double value);
}
member Tolerance : float with get, set
Property Value
Double
Remarks
 By default this is set to zero, but depending on your units of measure and how close objects may be, it is advised to set this to something more realistic. If the tolerance is positive, the outlines may be separated by the tolerance distance in each coordinate. If the tolerance is negative, the outlines must overlap by at least the tolerance distance in each coordinate.
See Also
Reference
BoundingBoxIntersectsFilter Class
Autodesk.Revit.DB Namespace